Enums/ВидыКонтроляТоваровОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыКонтроляТоваровОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонецМесяцаИДатаПоследнегоДвижения</Name>
					<Comment>Минимум остатка (на конец месяца; оперативный)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецДняКонецМесяцаИДатаПоследнегоДвижения</Name>
					<Comment>Минимум остатка (на конец дня; оперативный)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыКонтроляТоваровОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Расчет даты контроля товаров организаций по дате документа
//
// Параметры:
//	ДатаДокумента - Дата - дата документа, для которого выполняется контроль.
//
// Возвращаемое значение:
//	Дата - дата, на которую нужно выполнить контроль остатков товаров организаций.
//
Функция ДатаКонтроля(ДатаДокумента) Экспорт
	ВидКонтроля = Константы.ВидКонтроляТоваровОрганизаций.Получить();
	Если ВидКонтроля = Перечисления.ВидыКонтроляТоваровОрганизаций.КонецМесяцаИДатаПоследнегоДвижения Тогда
		ДатаГраницы = КонецМесяца(ДатаДокумента);
	ИначеЕсли ВидКонтроля = Перечисления.ВидыКонтроляТоваровОрганизаций.КонецДняКонецМесяцаИДатаПоследнегоДвижения Тогда
		ДатаГраницы = КонецДня(ДатаДокумента);
	Иначе
		ДатаГраницы = КонецМесяца(ДатаДокумента);
	КонецЕсли;
	Возврат ДатаГраницы;
КонецФункции

// Значение вида контроля товаров организаций по умолчанию
//
// Возвращаемое значение:
//	ПеречислениеСсылка.ВидыКонтроляТоваровОрганизаций - вид контроля товаров организаций по умолчанию.
//
Функция ПоУмолчанию() Экспорт
	Возврат Перечисления.ВидыКонтроляТоваровОрганизаций.КонецМесяцаИДатаПоследнегоДвижения;
КонецФункции

#КонецОбласти

#КонецЕсли
